In [78]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns 
pd.set_option('display.max_columns', None)

In [3]:
activity = pd.read_csv("Customer Flight Activity.csv", index_col=0)
loyalty = pd.read_csv("Customer Loyalty History.csv", index_col=0)

display(activity.head())
display(loyalty.head())

,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
Loyalty Number,,,,,,,,,,,,,,,
480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [55]:
def exploracion_basica(lista_df):
    for df in lista_df:
       display(df.head())
       print(df.shape)
       print('')
       print(df.isnull().sum()/df.shape[0]*100)
       print('')
       print(df.dtypes)
       for columna in df.select_dtypes(include='O'):
        print(df[columna].value_counts())
        print('')
       

       print('-'*20) 
        # for columna in df:
        #     print(columna.isnull().sum())

In [56]:
exploracion_basica([activity,loyalty])

,year,month,flights booked,flights with companions,total flights,distance,points accumulated,points redeemed,dollar cost points redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

(405624, 9)

year                           0.0
month                          0.0
flights booked                 0.0
flights with companions        0.0
total flights                  0.0
distance                       0.0
points accumulated             0.0
points redeemed                0.0
dollar cost points redeemed    0.0
dtype: float64

year                             int64
month                            int64
flights booked                   int64
flights with companions          int64
total flights                    int64
distance                         int64
points accumulated             float64
points redeemed                  int64
dollar cost points redeemed      int64
dtype: object
--------------------

,country,province,city,postal code,gender,education,salary,marital status,loyalty card,clv,enrollment type,enrollment year,enrollment month
Loyalty Number,,,,,,,,,,,,,
480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2
549612,canada,alberta,edmonton,t3g 6y6,male,college,NaN,divorced,star,3839.61,standard,2016,3
429460,canada,british columbia,vancouver,v6e 3d9,male,college,NaN,single,star,3839.75,standard,2014,7
608370,canada,ontario,toronto,p1w 1k4,male,college,NaN,single,star,3839.75,standard,2013,2
530508,canada,quebec,hull,j8y 3z5,male,bachelor,103495.0,married,star,3842.79,standard,2014,10

(16737, 13)

country              0.000000
province             0.000000
city                 0.000000
postal code          0.000000
gender               0.000000
education            0.000000
salary              25.321145
marital status       0.000000
loyalty card         0.000000
clv                  0.000000
enrollment type      0.000000
enrollment year      0.000000
enrollment month     0.000000
dtype: float64

country              object
province             object
city                 object
postal code          object
gender               object
education            object
salary              float64
marital status       object
loyalty card         object
clv                 float64
enrollment type      object
enrollment year       int64
enrollment month      int64
dtype: object
country
canada    16737
Name: count, dtype: int64

province
ontario                 5404
british columbia        4409
quebec                  3300
alberta                  969
manitoba                 658
new brunswick            636
nova scotia              518
saskatchewan             409
newfoundland             258
yukon                    110
prince edward island      66
Name: count, dtype: int64

city
toronto           3351
vancouver         2582
montreal          2059
winnipeg           658
whistler           582
halifax            518
ottawa             509
trenton            486
edmonton           486
quebec city        485
dawson creek       444
fredericton        425
regina             409
kingston           401
tremblant          398
victoria           389
hull               358
west vancouver     324
st. john's         258
thunder bay        256
sudbury            227
moncton            211
calgary            191
banff              179
london             174
peace river        113
whitehorse         110
kelowna             88
charlottetown       66
Name: count, dtype: int64

postal code
v6e 3d9    911
v5r 1w3    684
v6t 1y8    582
v6e 3z3    544
m2m 7k8    534
p1j 8t7    500
h2t 9k8    499
k8v 4b2    486
g1b 3l5    485
h2t 2j6    446
u5i 4f1    444
v1e 4r6    443
e3b 2h2    425
r2c 0m5    415
m9k 2p4    401
h5y 2s9    398
v10 6t5    389
k1f 2r2    389
h2y 2w2    365
j8y 3z5    358
m8y 4k8    340
h4g 3t4    338
b3j 9s2    329
v6v 8z3    324
p2t 6g3    322
h2y 4r4    315
m1r 4k3    313
p1l 8x8    282
p1w 1k4    275
t9g 1w3    266
a1c 6h9    258
m2z 4k1    257
k8t 5m5    256
p5s 6r4    246
m5v 1g5    227
s6j 3g0    226
t3g 6y6    220
e1a 2a7    211
t3e 2v9    191
b3c 2m8    189
s1j 3c5    183
t4v 1d4    179
m5b 3e4    174
m2m 6j7    153
r6y 4t5    143
m2p 4f6    126
k1g 4z0    120
t9o 2w2    113
y2k 6r0    110
r3r 3t4    100
h3t 8l4     89
v09 2e9     88
c1a 6e8     66
h3j 5i6      7
m3r 4k8      3
Name: count, dtype: int64

gender
female    8410
male      8327
Name: count, dtype: int64

education
bachelor                10475
college                  4238
high school or below      782
doctor                    734
master                    508
Name: count, dtype: int64

marital status
married     9735
single      4484
divorced    2518
Name: count, dtype: int64

loyalty card
star      7637
nova      5671
aurora    3429
Name: count, dtype: int64

enrollment type
standard          15766
2018 promotion      971
Name: count, dtype: int64

--------------------

In [46]:
loyalty.drop(columns=['Cancellation Month', 'Cancellation Year'], axis=1, inplace=True)

In [47]:
loyalty.columns

Index(['Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month'],
      dtype='object')

In [48]:
def nuevas_columnas(df):
    nuevas_columnas = {columna: columna.lower() for columna in df.columns}
    return df.rename(columns=nuevas_columnas, inplace= True)

def unify(valor):
    try:
        return valor.lower().strip()
    except:
        return valor

# aplicar cambios a df    
def homog_tablas(lista_df):
    for df in lista_df:
        nuevas_columnas(df)
    
    for df in lista_df:
        for columna in df.columns:
            df[columna] = df[columna].apply(unify)

In [49]:
homog_tablas([activity, loyalty])

In [50]:
display(activity.head())
display(loyalty.head())

,year,month,flights booked,flights with companions,total flights,distance,points accumulated,points redeemed,dollar cost points redeemed
Loyalty Number,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0
100102,2017,1,10,4,14,2030,203.0,0,0
100140,2017,1,6,0,6,1200,120.0,0,0
100214,2017,1,0,0,0,0,0.0,0,0
100272,2017,1,0,0,0,0,0.0,0,0

,country,province,city,postal code,gender,education,salary,marital status,loyalty card,clv,enrollment type,enrollment year,enrollment month
Loyalty Number,,,,,,,,,,,,,
480934,canada,ontario,toronto,m2z 4k1,female,bachelor,83236.0,married,star,3839.14,standard,2016,2
549612,canada,alberta,edmonton,t3g 6y6,male,college,NaN,divorced,star,3839.61,standard,2016,3
429460,canada,british columbia,vancouver,v6e 3d9,male,college,NaN,single,star,3839.75,standard,2014,7
608370,canada,ontario,toronto,p1w 1k4,male,college,NaN,single,star,3839.75,standard,2013,2
530508,canada,quebec,hull,j8y 3z5,male,bachelor,103495.0,married,star,3842.79,standard,2014,10

In [54]:
for columna in loyalty.select_dtypes(include='O'):
    print(loyalty[columna].value_counts())
    print('')

country
canada    16737
Name: count, dtype: int64

province
ontario                 5404
british columbia        4409
quebec                  3300
alberta                  969
manitoba                 658
new brunswick            636
nova scotia              518
saskatchewan             409
newfoundland             258
yukon                    110
prince edward island      66
Name: count, dtype: int64

city
toronto           3351
vancouver         2582
montreal          2059
winnipeg           658
whistler           582
halifax            518
ottawa             509
trenton            486
edmonton           486
quebec city        485
dawson creek       444
fredericton        425
regina             409
kingston           401
tremblant          398
victoria           389
hull               358
west vancouver     324
st. john's         258
thunder bay        256
sudbury            227
moncton            211
calgary            191
banff              179
london             174
peace river        113
whitehorse         110
kelowna             88
charlottetown       66
Name: count, dtype: int64

postal code
v6e 3d9    911
v5r 1w3    684
v6t 1y8    582
v6e 3z3    544
m2m 7k8    534
p1j 8t7    500
h2t 9k8    499
k8v 4b2    486
g1b 3l5    485
h2t 2j6    446
u5i 4f1    444
v1e 4r6    443
e3b 2h2    425
r2c 0m5    415
m9k 2p4    401
h5y 2s9    398
v10 6t5    389
k1f 2r2    389
h2y 2w2    365
j8y 3z5    358
m8y 4k8    340
h4g 3t4    338
b3j 9s2    329
v6v 8z3    324
p2t 6g3    322
h2y 4r4    315
m1r 4k3    313
p1l 8x8    282
p1w 1k4    275
t9g 1w3    266
a1c 6h9    258
m2z 4k1    257
k8t 5m5    256
p5s 6r4    246
m5v 1g5    227
s6j 3g0    226
t3g 6y6    220
e1a 2a7    211
t3e 2v9    191
b3c 2m8    189
s1j 3c5    183
t4v 1d4    179
m5b 3e4    174
m2m 6j7    153
r6y 4t5    143
m2p 4f6    126
k1g 4z0    120
t9o 2w2    113
y2k 6r0    110
r3r 3t4    100
h3t 8l4     89
v09 2e9     88
c1a 6e8     66
h3j 5i6      7
m3r 4k8      3
Name: count, dtype: int64

gender
female    8410
male      8327
Name: count, dtype: int64

education
bachelor                10475
college                  4238
high school or below      782
doctor                    734
master                    508
Name: count, dtype: int64

marital status
married     9735
single      4484
divorced    2518
Name: count, dtype: int64

loyalty card
star      7637
nova      5671
aurora    3429
Name: count, dtype: int64

enrollment type
standard          15766
2018 promotion      971
Name: count, dtype: int64

## unir df

In [59]:
df = activity.merge(loyalty, how='left', on='Loyalty Number')
df.head()

,year,month,flights booked,flights with companions,total flights,distance,points accumulated,points redeemed,dollar cost points redeemed,country,province,city,postal code,gender,education,salary,marital status,loyalty card,clv,enrollment type,enrollment year,enrollment month
Loyalty Number,,,,,,,,,,,,,,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0,canada,alberta,edmonton,t9g 1w3,female,bachelor,92552.0,married,aurora,7919.20,standard,2016,8
100102,2017,1,10,4,14,2030,203.0,0,0,canada,ontario,toronto,m1r 4k3,male,college,NaN,single,nova,2887.74,standard,2013,3
100140,2017,1,6,0,6,1200,120.0,0,0,canada,british columbia,dawson creek,u5i 4f1,female,college,NaN,divorced,nova,2838.07,standard,2016,7
100214,2017,1,0,0,0,0,0.0,0,0,canada,british columbia,vancouver,v5r 1w3,male,bachelor,63253.0,married,star,4170.57,standard,2015,8
100272,2017,1,0,0,0,0,0.0,0,0,canada,ontario,toronto,p1l 8x8,female,bachelor,91163.0,divorced,star,6622.05,standard,2014,1

In [79]:
df.to_csv('datos_flight.csv')

In [60]:
print(activity.shape)
print(loyalty.shape)
print(df.shape)

(405624, 9)
(16737, 13)
(405624, 22)

In [62]:
exploracion_basica([df])

,year,month,flights booked,flights with companions,total flights,distance,points accumulated,points redeemed,dollar cost points redeemed,country,province,city,postal code,gender,education,salary,marital status,loyalty card,clv,enrollment type,enrollment year,enrollment month
Loyalty Number,,,,,,,,,,,,,,,,,,,,,,
100018,2017,1,3,0,3,1521,152.0,0,0,canada,alberta,edmonton,t9g 1w3,female,bachelor,92552.0,married,aurora,7919.20,standard,2016,8
100102,2017,1,10,4,14,2030,203.0,0,0,canada,ontario,toronto,m1r 4k3,male,college,NaN,single,nova,2887.74,standard,2013,3
100140,2017,1,6,0,6,1200,120.0,0,0,canada,british columbia,dawson creek,u5i 4f1,female,college,NaN,divorced,nova,2838.07,standard,2016,7
100214,2017,1,0,0,0,0,0.0,0,0,canada,british columbia,vancouver,v5r 1w3,male,bachelor,63253.0,married,star,4170.57,standard,2015,8
100272,2017,1,0,0,0,0,0.0,0,0,canada,ontario,toronto,p1l 8x8,female,bachelor,91163.0,divorced,star,6622.05,standard,2014,1

(405624, 22)

year                            0.000000
month                           0.000000
flights booked                  0.000000
flights with companions         0.000000
total flights                   0.000000
distance                        0.000000
points accumulated              0.000000
points redeemed                 0.000000
dollar cost points redeemed     0.000000
country                         0.000000
province                        0.000000
city                            0.000000
postal code                     0.000000
gender                          0.000000
education                       0.000000
salary                         25.312112
marital status                  0.000000
loyalty card                    0.000000
clv                             0.000000
enrollment type                 0.000000
enrollment year                 0.000000
enrollment month                0.000000
dtype: float64

year                             int64
month                            int64
flights booked                   int64
flights with companions          int64
total flights                    int64
distance                         int64
points accumulated             float64
points redeemed                  int64
dollar cost points redeemed      int64
country                         object
province                        object
city                            object
postal code                     object
gender                          object
education                       object
salary                         float64
marital status                  object
loyalty card                    object
clv                            float64
enrollment type                 object
enrollment year                  int64
enrollment month                 int64
dtype: object
country
canada    405624
Name: count, dtype: int64

province
ontario                 130896
british columbia        106848
quebec                   79968
alberta                  23400
manitoba                 15984
new brunswick            15432
nova scotia              12576
saskatchewan              9936
newfoundland              6312
yukon                     2688
prince edward island      1584
Name: count, dtype: int64

city
toronto           81096
vancouver         62520
montreal          49920
winnipeg          15984
whistler          14040
halifax           12576
ottawa            12312
edmonton          11808
quebec city       11760
trenton           11760
dawson creek      10776
fredericton       10344
regina             9936
kingston           9720
tremblant          9600
victoria           9504
hull               8688
west vancouver     7872
st. john's         6312
thunder bay        6264
sudbury            5520
moncton            5088
calgary            4584
banff              4296
london             4224
peace river        2712
whitehorse         2688
kelowna            2136
charlottetown      1584
Name: count, dtype: int64

postal code
v6e 3d9    21984
v5r 1w3    16608
v6t 1y8    14040
v6e 3z3    13200
m2m 7k8    12936
p1j 8t7    12168
h2t 9k8    12024
g1b 3l5    11760
k8v 4b2    11760
h2t 2j6    10800
u5i 4f1    10776
v1e 4r6    10728
e3b 2h2    10344
r2c 0m5    10104
m9k 2p4     9720
h5y 2s9     9600
v10 6t5     9504
k1f 2r2     9408
h2y 2w2     8880
j8y 3z5     8688
m8y 4k8     8256
h4g 3t4     8208
b3j 9s2     8016
v6v 8z3     7872
p2t 6g3     7800
h2y 4r4     7656
m1r 4k3     7536
p1l 8x8     6792
p1w 1k4     6624
t9g 1w3     6456
a1c 6h9     6312
k8t 5m5     6264
m2z 4k1     6192
p5s 6r4     5976
m5v 1g5     5520
s6j 3g0     5472
t3g 6y6     5352
e1a 2a7     5088
t3e 2v9     4584
b3c 2m8     4560
s1j 3c5     4464
t4v 1d4     4296
m5b 3e4     4224
m2m 6j7     3696
r6y 4t5     3480
m2p 4f6     3048
k1g 4z0     2904
t9o 2w2     2712
y2k 6r0     2688
r3r 3t4     2400
h3t 8l4     2184
v09 2e9     2136
c1a 6e8     1584
h3j 5i6      168
m3r 4k8       72
Name: count, dtype: int64

gender
female    203640
male      201984
Name: count, dtype: int64

education
bachelor                253752
college                 102672
high school or below     19008
doctor                   17856
master                   12336
Name: count, dtype: int64

marital status
married     235800
single      108648
divorced     61176
Name: count, dtype: int64

loyalty card
star      184224
nova      137568
aurora     83832
Name: count, dtype: int64

enrollment type
standard          382200
2018 promotion     23424
Name: count, dtype: int64

--------------------

## exploración salary

In [105]:
df2 = df.copy()

In [111]:
df[(df['education']=='college')]['salary'].value_counts()

Series([], Name: count, dtype: int64)

In [115]:
df['salary'].isnull().sum()/df.shape[0]*100

25.31360946745562

In [114]:
df[(df['education']=='college')]['salary'].isnull().sum()/df.shape[0]*100

25.31360946745562

In [109]:
df = df.drop(df[(df['education']=='high school or below') & (df['salary'] < 0)].index)

In [67]:
df['salary'].agg(['mean', 'median', 'std', 'min', 'max'])

mean       79268.825953
median     73479.000000
std        34992.133508
min       -58486.000000
max       407228.000000
Name: salary, dtype: float64

In [110]:
for level in df['education'].unique():
    try:
        print(df[df['education']== level]['salary'].isnull().sum()/df.shape[0]*100)
        print(level, '\n', df[(df['salary'] < 0) & (df['education'] == level)]['salary'].agg(['min', 'max', 'mean', 'median', 'std']))
        print(level, '\n', df[(df['salary'] > 0) & (df['education'] == level)]['salary'].agg(['min', 'max', 'mean', 'median', 'std']))
        print('')
    except:
        pass

0.0
bachelor
 min      -58486.000000
max       -9081.000000
mean     -34786.052632
median   -39503.000000
std       15669.232112
Name: salary, dtype: float64
bachelor
 min        15609.000000
max       105563.000000
mean       72669.312393
median     72029.000000
std        16594.537958
Name: salary, dtype: float64

25.31360946745562
college
 min      NaN
max      NaN
mean     NaN
median   NaN
std      NaN
Name: salary, dtype: float64
college
 min      NaN
max      NaN
mean     NaN
median   NaN
std      NaN
Name: salary, dtype: float64

0.0
master
 min      NaN
max      NaN
mean     NaN
median   NaN
std      NaN
Name: salary, dtype: float64
master
 min        56414.000000
max       133080.000000
mean      103767.494163
median    105487.000000
std        17514.343573
Name: salary, dtype: float64

0.0
high school or below
 min      NaN
max      NaN
mean     NaN
median   NaN
std      NaN
Name: salary, dtype: float64
high school or below
 min       21853.000000
max       93875.000000
mean      61126.640961
median    61806.000000
std       12106.082753
Name: salary, dtype: float64

0.0
doctor
 min      NaN
max      NaN
mean     NaN
median   NaN
std      NaN
Name: salary, dtype: float64
doctor
 min        48109.000000
max       407228.000000
mean      178335.439516
median    180440.000000
std        70307.642502
Name: salary, dtype: float64

In [ ]:
df.to_csv('datos_flight.csv')